@FernandoMiguel It's strange because of in my case, when I'm using
```
data "kubectl_path_documents" "karpenter_provisioners" {
  pattern = "${path.module}/provisioners/*.yaml"
  vars = {
    azs                     = join(",", local.azs)
    iam-instance-profile-id = "${var.eks_iam_instance_profile_id}"
    eks-cluster-id          = var.eks_cluster_id
    eks-vpc_name            = var.vpc_name
  }
}

resource "kubectl_manifest" "karpenter_provisioner" {
  for_each          = toset(data.kubectl_path_documents.karpenter_provisioners.documents)
  yaml_body         = each.value
  apply_only        = true
  server_side_apply = true

  depends_on = [module.eks_blueprints_kubernetes_addons]
}
```
terraform creates name for resource like this:
```
  # kubectl_manifest.karpenter_provisioner["apiVersion: karpenter.sh/v1alpha5\nkind: Provisioner\nmetadata:\n  name: runners\nspec:\n  requirements:\n    - key: \"topology.kubernetes.io/zone\"\n      operator: In\n      values: [us-east-1a,us-east-1b,us-east-1c,us-east-1d]\n    - key: \"karpenter.sh/capacity-type\"\n      operator: In\n      values: [\"spot\"]\n  limits:\n    resources:\n      cpu: 30\n  provider:\n    instanceProfile: eks-NodeInstanceRole\n    subnetSelector:\n      karpenter.sh/discovery/test: 'test'\n    securityGroupSelector:\n      karpenter.sh/discovery/test: 'test'\n    tags:\n      karpenter.sh/discovery/test: 'test'\n  labels:\n    type: karpenter\n    provisioner: runners\n  ttlSecondsAfterEmpty: 600\n  ttlSecondsUntilExpired: 172800"] will be created
  + resource "kubectl_manifest" "karpenter_provisioner" {
      + api_version             = "karpenter.sh/v1alpha5"
      + apply_only              = true
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Provisioner"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "runners"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1alpha5
            kind: Provisioner
            metadata:
              name: runners
            spec:
              labels:
                provisioner: runners
                type: karpenter
              limits:
                resources:
                  cpu: 30
              provider:
                instanceProfile: eks-NodeInstanceRole
                securityGroupSelector:
                  karpenter.sh/discovery/test: test
                subnetSelector:
                  karpenter.sh/discovery/test: test
                tags:
                  karpenter.sh/discovery/test: test
              requirements:
              - key: topology.kubernetes.io/zone
                operator: In
                values:
                - us-east-1a
                - us-east-1b
                - us-east-1c
                - us-east-1d
              - key: karpenter.sh/capacity-type
                operator: In
                values:
                - spot
              ttlSecondsAfterEmpty: 600
              ttlSecondsUntilExpired: 172800
        EOT
      + yaml_incluster          = (sensitive value)
    }
```
Of course, if any changes to provisioner it will delete resource and create a new one. If I use `for_each          = data.kubectl_path_documents.karpenter_provisioners.manifests` then resources creating like this (showing output of destroying):

```
  # kubectl_manifest.karpenter_provisioner["/apis/karpenter.sh/v1alpha5/provisioners/runners"] will be destroyed
  # (because key ["/apis/karpenter.sh/v1alpha5/provisioners/runners"] is not in for_each map)
  - resource "kubectl_manifest" "karpenter_provisioner" {
      - api_version             = "karpenter.sh/v1alpha5" -> null
      - apply_only              = true -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/karpenter.sh/v1alpha5/provisioners/runners" -> null
      - kind                    = "Provisioner" -> null
      - live_manifest_incluster = (sensitive value)
      - live_uid                = "30ad94f0-4c34-486c-8540-2224745e7b5f" -> null
      - name                    = "runners" -> null
      - server_side_apply       = true -> null
      - uid                     = "30ad94f0-4c34-486c-8540-2224745e7b5f" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value)
      - yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1alpha5
            kind: Provisioner
            metadata:
              name: runners
            spec:
              labels:
                provisioner: runners
                type: karpenter
              limits:
                resources:
                  cpu: 30
              provider:
                instanceProfile: eks-NodeInstanceRole
                securityGroupSelector:
                  karpenter.sh/discovery/test: test
                subnetSelector:
                  karpenter.sh/discovery/test: test
                tags:
                  karpenter.sh/discovery/test: test
              requirements:
              - key: topology.kubernetes.io/zone
                operator: In
                values:
                - us-east-1a
                - us-east-1b
                - us-east-1c
                - us-east-1d
              - key: karpenter.sh/capacity-type
                operator: In
                values:
                - spot
              ttlSecondsAfterEmpty: 600
              ttlSecondsUntilExpired: 172800
        EOT -> null
      - yaml_incluster          = (sensitive value)
    }
```